# Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.

n1 = input('Введите  целое число: ')
x = 0
while n1 > 0:
    if n1
print(x)
